In [2]:
import pandas as pd

'2.2.2'

In [16]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['Tokyo', 'Osaka', 'Kyoto', 'Osaka']
}

df = pd.DataFrame(data)
display(df)

      name  age   city
0    Alice   25  Tokyo
1      Bob   30  Osaka
2  Charlie   35  Kyoto
3    David   40  Osaka

In [17]:
df.to_csv('example.csv', index=False)